// // Homework#5 JS#1


/*
1) Создать функцию, генерирующую шахматную доску.При этом можно использовать любые html - теги по своему желанию.Доска должна быть разлинована соответствующим образом, т.е.
чередовать черные и белые ячейки.Строки должны нумероваться числами от 1 до 8, столбцы
– латинскими буквами A, B, C, D, E, F, G, H.
*/


/* 
  2) Заполнить созданную таблицу буквами, отвечающими за шахматную фигуру, например К -
    король, Ф – ферзь и тп., причем все фигуры должны стоять на своих местах и быть
  соответственно черными и белыми.
*/


/*
  3) * Заменить буквы, обозначающие фигуры картинками.
*/


/*
  4) * Создать массив объектов товаров, схожих с массивом объектов корзины и по шаблону, организовать
   вывод всех товаров на страницу, которая была сверстана к последнему уроку. 
   (То есть из верстки в index.html должны уйти все карточки товаров, должен остатся только шаблон товара, по которому сгенерируются все остальные товары на странице).
*/